<script lang="ts" setup>
</script>

<template>
  <div id="app">
    <p>Данное расширение предназначено для взаимодействия с
       системой продвижения вашего бизнеса на основе искусственного интеллекта.
    </p>
    <p>Для работы с данной системой нужно зарегистрироваться на
      <a href="https://business.t3t.online">главной странице системы</a>, при регистрации
      нужно указывать точное наименование организации, кабинет которой в яндекс-бизнесе
      вы намерены присоединить к функционалу системы.
    </p>
    <p>После заполнения в системе необходимых данных, находясь в кабинете выбранной организации
      на <a href="https://yandex.ru/sprav/">яндекс-бизнесе</a>, при нажатии кнопки "Запустить помощника",
      нужно ввести данные, с которыми вы регистрировались в системе.
    </p>
    <p>При правильном выполнении данных действий запустится автоматическая процедура, которая будет постоянно
       следить за появлением отзывов, при их появлении отправлять на обработку искусственным интеллектом в системе,
       после формирования искусственным интеллектом ответа и его утверждения (может быть настроено как ручным,
       так и автоматическим) ответ будет автоматически опубликован в привязке к поступившему отзыву.
    </p>
    <p>Процедура постоянно работает при открытой вкладке и закрывать её не нужно.
      Поскольку процедура полностью имитирует ваше поведение на сайте яндекс-бизнеса,
      в случае необходимости самостоятельных действий в кабинете, нужно остановить процедуру,
      это производится нажатием кнопки "Остановить". При нажатии кнопки "Выйти" произойдёт полное
      отключение от системы и для повторного запуска потребуется нажать кнопку "Запустить помощника"
      и снова ввести регистрационные данные.
    </p>
  </div>
</template>

<style scoped>
</style>
